OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/pic16/pic18fregs.h
/*
 *
 * This file is generated automatically by the device-manager.pl program.
 *
 * Copyright (C) 2012-2015, Molnar Karoly <molnarkaroly@users.sf.net>
 *
 */

#ifndef __PIC18FREGS_H__
#define __PIC18FREGS_H__

#if defined(__SDCC_PIC18F13K22)
  #include <pic18f13k22.h>

#elif defined(__SDCC_PIC18F13K50)
  #include <pic18f13k50.h>

#elif defined(__SDCC_PIC18F14K22)
  #include <pic18f14k22.h>

#elif defined(__SDCC_PIC18F14K50)
  #include <pic18f14k50.h>

#elif defined(__SDCC_PIC18F23K20)
  #include <pic18f23k20.h>

#elif defined(__SDCC_PIC18F23K22)
  #include <pic18f23k22.h>

#elif defined(__SDCC_PIC18F24J10)
  #include <pic18f24j10.h>

#elif defined(__SDCC_PIC18F24J11)
  #include <pic18f24j11.h>

#elif defined(__SDCC_PIC18F24J50)
  #include <pic18f24j50.h>

#elif defined(__SDCC_PIC18F24K20)
  #include <pic18f24k20.h>

#elif defined(__SDCC_PIC18F24K22)
  #include <pic18f24k22.h>

#elif defined(__SDCC_PIC18F24K50)
  #include <pic18f24k50.h>

#elif defined(__SDCC_PIC18F25J10)
  #include <pic18f25j10.h>

#elif defined(__SDCC_PIC18F25J11)
  #include <pic18f25j11.h>

#elif defined(__SDCC_PIC18F25J50)
  #include <pic18f25j50.h>

#elif defined(__SDCC_PIC18F25K20)
  #include <pic18f25k20.h>

#elif defined(__SDCC_PIC18F25K22)
  #include <pic18f25k22.h>

#elif defined(__SDCC_PIC18F25K50)
  #include <pic18f25k50.h>

#elif defined(__SDCC_PIC18F25K80)
  #include <pic18f25k80.h>

#elif defined(__SDCC_PIC18F26J11)
  #include <pic18f26j11.h>

#elif defined(__SDCC_PIC18F26J13)
  #include <pic18f26j13.h>

#elif defined(__SDCC_PIC18F26J50)
  #include <pic18f26j50.h>

#elif defined(__SDCC_PIC18F26J53)
  #include <pic18f26j53.h>

#elif defined(__SDCC_PIC18F26K20)
  #include <pic18f26k20.h>

#elif defined(__SDCC_PIC18F26K22)
  #include <pic18f26k22.h>

#elif defined(__SDCC_PIC18F26K80)
  #include <pic18f26k80.h>

#elif defined(__SDCC_PIC18F27J13)
  #include <pic18f27j13.h>

#elif defined(__SDCC_PIC18F27J53)
  #include <pic18f27j53.h>

#elif defined(__SDCC_PIC18F43K20)
  #include <pic18f43k20.h>

#elif defined(__SDCC_PIC18F43K22)
  #include <pic18f43k22.h>

#elif defined(__SDCC_PIC18F44J10)
  #include <pic18f44j10.h>

#elif defined(__SDCC_PIC18F44J11)
  #include <pic18f44j11.h>

#elif defined(__SDCC_PIC18F44J50)
  #include <pic18f44j50.h>

#elif defined(__SDCC_PIC18F44K20)
  #include <pic18f44k20.h>

#elif defined(__SDCC_PIC18F44K22)
  #include <pic18f44k22.h>

#elif defined(__SDCC_PIC18F45J10)
  #include <pic18f45j10.h>

#elif defined(__SDCC_PIC18F45J11)
  #include <pic18f45j11.h>

#elif defined(__SDCC_PIC18F45J50)
  #include <pic18f45j50.h>

#elif defined(__SDCC_PIC18F45K20)
  #include <pic18f45k20.h>

#elif defined(__SDCC_PIC18F45K22)
  #include <pic18f45k22.h>

#elif defined(__SDCC_PIC18F45K50)
  #include <pic18f45k50.h>

#elif defined(__SDCC_PIC18F45K80)
  #include <pic18f45k80.h>

#elif defined(__SDCC_PIC18F46J11)
  #include <pic18f46j11.h>

#elif defined(__SDCC_PIC18F46J13)
  #include <pic18f46j13.h>

#elif defined(__SDCC_PIC18F46J50)
  #include <pic18f46j50.h>

#elif defined(__SDCC_PIC18F46J53)
  #include <pic18f46j53.h>

#elif defined(__SDCC_PIC18F46K20)
  #include <pic18f46k20.h>

#elif defined(__SDCC_PIC18F46K22)
  #include <pic18f46k22.h>

#elif defined(__SDCC_PIC18F46K80)
  #include <pic18f46k80.h>

#elif defined(__SDCC_PIC18F47J13)
  #include <pic18f47j13.h>

#elif defined(__SDCC_PIC18F47J53)
  #include <pic18f47j53.h>

#elif defined(__SDCC_PIC18F63J11)
  #include <pic18f63j11.h>

#elif defined(__SDCC_PIC18F63J90)
  #include <pic18f63j90.h>

#elif defined(__SDCC_PIC18F64J11)
  #include <pic18f64j11.h>

#elif defined(__SDCC_PIC18F64J90)
  #include <pic18f64j90.h>

#elif defined(__SDCC_PIC18F65J10)
  #include <pic18f65j10.h>

#elif defined(__SDCC_PIC18F65J11)
  #include <pic18f65j11.h>

#elif defined(__SDCC_PIC18F65J15)
  #include <pic18f65j15.h>

#elif defined(__SDCC_PIC18F65J50)
  #include <pic18f65j50.h>

#elif defined(__SDCC_PIC18F65J90)
  #include <pic18f65j90.h>

#elif defined(__SDCC_PIC18F65J94)
  #include <pic18f65j94.h>

#elif defined(__SDCC_PIC18F65K22)
  #include <pic18f65k22.h>

#elif defined(__SDCC_PIC18F65K80)
  #include <pic18f65k80.h>

#elif defined(__SDCC_PIC18F65K90)
  #include <pic18f65k90.h>

#elif defined(__SDCC_PIC18F66J10)
  #include <pic18f66j10.h>

#elif defined(__SDCC_PIC18F66J11)
  #include <pic18f66j11.h>

#elif defined(__SDCC_PIC18F66J15)
  #include <pic18f66j15.h>

#elif defined(__SDCC_PIC18F66J16)
  #include <pic18f66j16.h>

#elif defined(__SDCC_PIC18F66J50)
  #include <pic18f66j50.h>

#elif defined(__SDCC_PIC18F66J55)
  #include <pic18f66j55.h>

#elif defined(__SDCC_PIC18F66J60)
  #include <pic18f66j60.h>

#elif defined(__SDCC_PIC18F66J65)
  #include <pic18f66j65.h>

#elif defined(__SDCC_PIC18F66J90)
  #include <pic18f66j90.h>

#elif defined(__SDCC_PIC18F66J93)
  #include <pic18f66j93.h>

#elif defined(__SDCC_PIC18F66J94)
  #include <pic18f66j94.h>

#elif defined(__SDCC_PIC18F66J99)
  #include <pic18f66j99.h>

#elif defined(__SDCC_PIC18F66K22)
  #include <pic18f66k22.h>

#elif defined(__SDCC_PIC18F66K80)
  #include <pic18f66k80.h>

#elif defined(__SDCC_PIC18F66K90)
  #include <pic18f66k90.h>

#elif defined(__SDCC_PIC18F67J10)
  #include <pic18f67j10.h>

#elif defined(__SDCC_PIC18F67J11)
  #include <pic18f67j11.h>

#elif defined(__SDCC_PIC18F67J50)
  #include <pic18f67j50.h>

#elif defined(__SDCC_PIC18F67J60)
  #include <pic18f67j60.h>

#elif defined(__SDCC_PIC18F67J90)
  #include <pic18f67j90.h>

#elif defined(__SDCC_PIC18F67J93)
  #include <pic18f67j93.h>

#elif defined(__SDCC_PIC18F67J94)
  #include <pic18f67j94.h>

#elif defined(__SDCC_PIC18F67K22)
  #include <pic18f67k22.h>

#elif defined(__SDCC_PIC18F67K90)
  #include <pic18f67k90.h>

#elif defined(__SDCC_PIC18F83J11)
  #include <pic18f83j11.h>

#elif defined(__SDCC_PIC18F83J90)
  #include <pic18f83j90.h>

#elif defined(__SDCC_PIC18F84J11)
  #include <pic18f84j11.h>

#elif defined(__SDCC_PIC18F84J90)
  #include <pic18f84j90.h>

#elif defined(__SDCC_PIC18F85J10)
  #include <pic18f85j10.h>

#elif defined(__SDCC_PIC18F85J11)
  #include <pic18f85j11.h>

#elif defined(__SDCC_PIC18F85J15)
  #include <pic18f85j15.h>

