OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/pic16/pic18fregs.h
#elif defined(__SDCC_PIC18F85J50)
  #include <pic18f85j50.h>

#elif defined(__SDCC_PIC18F85J90)
  #include <pic18f85j90.h>

#elif defined(__SDCC_PIC18F85J94)
  #include <pic18f85j94.h>

#elif defined(__SDCC_PIC18F85K22)
  #include <pic18f85k22.h>

#elif defined(__SDCC_PIC18F85K90)
  #include <pic18f85k90.h>

#elif defined(__SDCC_PIC18F86J10)
  #include <pic18f86j10.h>

#elif defined(__SDCC_PIC18F86J11)
  #include <pic18f86j11.h>

#elif defined(__SDCC_PIC18F86J15)
  #include <pic18f86j15.h>

#elif defined(__SDCC_PIC18F86J16)
  #include <pic18f86j16.h>

#elif defined(__SDCC_PIC18F86J50)
  #include <pic18f86j50.h>

#elif defined(__SDCC_PIC18F86J55)
  #include <pic18f86j55.h>

#elif defined(__SDCC_PIC18F86J60)
  #include <pic18f86j60.h>

#elif defined(__SDCC_PIC18F86J65)
  #include <pic18f86j65.h>

#elif defined(__SDCC_PIC18F86J72)
  #include <pic18f86j72.h>

#elif defined(__SDCC_PIC18F86J90)
  #include <pic18f86j90.h>

#elif defined(__SDCC_PIC18F86J93)
  #include <pic18f86j93.h>

#elif defined(__SDCC_PIC18F86J94)
  #include <pic18f86j94.h>

#elif defined(__SDCC_PIC18F86J99)
  #include <pic18f86j99.h>

#elif defined(__SDCC_PIC18F86K22)
  #include <pic18f86k22.h>

#elif defined(__SDCC_PIC18F86K90)
  #include <pic18f86k90.h>

#elif defined(__SDCC_PIC18F87J10)
  #include <pic18f87j10.h>

#elif defined(__SDCC_PIC18F87J11)
  #include <pic18f87j11.h>

#elif defined(__SDCC_PIC18F87J50)
  #include <pic18f87j50.h>

#elif defined(__SDCC_PIC18F87J60)
  #include <pic18f87j60.h>

#elif defined(__SDCC_PIC18F87J72)
  #include <pic18f87j72.h>

#elif defined(__SDCC_PIC18F87J90)
  #include <pic18f87j90.h>

#elif defined(__SDCC_PIC18F87J93)
  #include <pic18f87j93.h>

#elif defined(__SDCC_PIC18F87J94)
  #include <pic18f87j94.h>

#elif defined(__SDCC_PIC18F87K22)
  #include <pic18f87k22.h>

#elif defined(__SDCC_PIC18F87K90)
  #include <pic18f87k90.h>

#elif defined(__SDCC_PIC18F95J94)
  #include <pic18f95j94.h>

#elif defined(__SDCC_PIC18F96J60)
  #include <pic18f96j60.h>

#elif defined(__SDCC_PIC18F96J65)
  #include <pic18f96j65.h>

#elif defined(__SDCC_PIC18F96J94)
  #include <pic18f96j94.h>

#elif defined(__SDCC_PIC18F96J99)
  #include <pic18f96j99.h>

#elif defined(__SDCC_PIC18F97J60)
  #include <pic18f97j60.h>

#elif defined(__SDCC_PIC18F97J94)
  #include <pic18f97j94.h>

#elif defined(__SDCC_PIC18F242)
  #include <pic18f242.h>

#elif defined(__SDCC_PIC18F248)
  #include <pic18f248.h>

#elif defined(__SDCC_PIC18F252)
  #include <pic18f252.h>

#elif defined(__SDCC_PIC18F258)
  #include <pic18f258.h>

#elif defined(__SDCC_PIC18F442)
  #include <pic18f442.h>

#elif defined(__SDCC_PIC18F448)
  #include <pic18f448.h>

#elif defined(__SDCC_PIC18F452)
  #include <pic18f452.h>

#elif defined(__SDCC_PIC18F458)
  #include <pic18f458.h>

#elif defined(__SDCC_PIC18F1220)
  #include <pic18f1220.h>

#elif defined(__SDCC_PIC18F1230)
  #include <pic18f1230.h>

#elif defined(__SDCC_PIC18F1320)
  #include <pic18f1320.h>

#elif defined(__SDCC_PIC18F1330)
  #include <pic18f1330.h>

#elif defined(__SDCC_PIC18F2220)
  #include <pic18f2220.h>

#elif defined(__SDCC_PIC18F2221)
  #include <pic18f2221.h>

#elif defined(__SDCC_PIC18F2320)
  #include <pic18f2320.h>

#elif defined(__SDCC_PIC18F2321)
  #include <pic18f2321.h>

#elif defined(__SDCC_PIC18F2331)
  #include <pic18f2331.h>

#elif defined(__SDCC_PIC18F2410)
  #include <pic18f2410.h>

#elif defined(__SDCC_PIC18F2420)
  #include <pic18f2420.h>

#elif defined(__SDCC_PIC18F2423)
  #include <pic18f2423.h>

#elif defined(__SDCC_PIC18F2431)
  #include <pic18f2431.h>

#elif defined(__SDCC_PIC18F2439)
  #include <pic18f2439.h>

#elif defined(__SDCC_PIC18F2450)
  #include <pic18f2450.h>

#elif defined(__SDCC_PIC18F2455)
  #include <pic18f2455.h>

#elif defined(__SDCC_PIC18F2458)
  #include <pic18f2458.h>

#elif defined(__SDCC_PIC18F2480)
  #include <pic18f2480.h>

#elif defined(__SDCC_PIC18F2510)
  #include <pic18f2510.h>

#elif defined(__SDCC_PIC18F2515)
  #include <pic18f2515.h>

#elif defined(__SDCC_PIC18F2520)
  #include <pic18f2520.h>

#elif defined(__SDCC_PIC18F2523)
  #include <pic18f2523.h>

#elif defined(__SDCC_PIC18F2525)
  #include <pic18f2525.h>

#elif defined(__SDCC_PIC18F2539)
  #include <pic18f2539.h>

#elif defined(__SDCC_PIC18F2550)
  #include <pic18f2550.h>

#elif defined(__SDCC_PIC18F2553)
  #include <pic18f2553.h>

#elif defined(__SDCC_PIC18F2580)
  #include <pic18f2580.h>

#elif defined(__SDCC_PIC18F2585)
  #include <pic18f2585.h>

#elif defined(__SDCC_PIC18F2610)
  #include <pic18f2610.h>

#elif defined(__SDCC_PIC18F2620)
  #include <pic18f2620.h>

#elif defined(__SDCC_PIC18F2680)
  #include <pic18f2680.h>

#elif defined(__SDCC_PIC18F2682)
  #include <pic18f2682.h>

#elif defined(__SDCC_PIC18F2685)
  #include <pic18f2685.h>

#elif defined(__SDCC_PIC18F4220)
  #include <pic18f4220.h>

#elif defined(__SDCC_PIC18F4221)
  #include <pic18f4221.h>

#elif defined(__SDCC_PIC18F4320)
  #include <pic18f4320.h>

#elif defined(__SDCC_PIC18F4321)
  #include <pic18f4321.h>

#elif defined(__SDCC_PIC18F4331)
  #include <pic18f4331.h>

#elif defined(__SDCC_PIC18F4410)
  #include <pic18f4410.h>

#elif defined(__SDCC_PIC18F4420)
  #include <pic18f4420.h>

#elif defined(__SDCC_PIC18F4423)
  #include <pic18f4423.h>

#elif defined(__SDCC_PIC18F4431)
  #include <pic18f4431.h>

#elif defined(__SDCC_PIC18F4439)
  #include <pic18f4439.h>

#elif defined(__SDCC_PIC18F4450)
  #include <pic18f4450.h>

#elif defined(__SDCC_PIC18F4455)
  #include <pic18f4455.h>

#elif defined(__SDCC_PIC18F4458)
  #include <pic18f4458.h>

#elif defined(__SDCC_PIC18F4480)
  #include <pic18f4480.h>

#elif defined(__SDCC_PIC18F4510)
  #include <pic18f4510.h>

#elif defined(__SDCC_PIC18F4515)
  #include <pic18f4515.h>

#elif defined(__SDCC_PIC18F4520)
  #include <pic18f4520.h>

#elif defined(__SDCC_PIC18F4523)
  #include <pic18f4523.h>

#elif defined(__SDCC_PIC18F4525)
  #include <pic18f4525.h>

#elif defined(__SDCC_PIC18F4539)
  #include <pic18f4539.h>

#elif defined(__SDCC_PIC18F4550)
  #include <pic18f4550.h>

#elif defined(__SDCC_PIC18F4553)
  #include <pic18f4553.h>

#elif defined(__SDCC_PIC18F4580)
  #include <pic18f4580.h>

#elif defined(__SDCC_PIC18F4585)
  #include <pic18f4585.h>

#elif defined(__SDCC_PIC18F4610)
  #include <pic18f4610.h>

#elif defined(__SDCC_PIC18F4620)
  #include <pic18f4620.h>

#elif defined(__SDCC_PIC18F4680)
  #include <pic18f4680.h>

#elif defined(__SDCC_PIC18F4682)
  #include <pic18f4682.h>

