OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/pic16/pic18fregs.h
#elif defined(__SDCC_PIC18F4685)
  #include <pic18f4685.h>

#elif defined(__SDCC_PIC18F6310)
  #include <pic18f6310.h>

#elif defined(__SDCC_PIC18F6390)
  #include <pic18f6390.h>

#elif defined(__SDCC_PIC18F6393)
  #include <pic18f6393.h>

#elif defined(__SDCC_PIC18F6410)
  #include <pic18f6410.h>

#elif defined(__SDCC_PIC18F6490)
  #include <pic18f6490.h>

#elif defined(__SDCC_PIC18F6493)
  #include <pic18f6493.h>

#elif defined(__SDCC_PIC18F6520)
  #include <pic18f6520.h>

#elif defined(__SDCC_PIC18F6525)
  #include <pic18f6525.h>

#elif defined(__SDCC_PIC18F6527)
  #include <pic18f6527.h>

#elif defined(__SDCC_PIC18F6585)
  #include <pic18f6585.h>

#elif defined(__SDCC_PIC18F6620)
  #include <pic18f6620.h>

#elif defined(__SDCC_PIC18F6621)
  #include <pic18f6621.h>

#elif defined(__SDCC_PIC18F6622)
  #include <pic18f6622.h>

#elif defined(__SDCC_PIC18F6627)
  #include <pic18f6627.h>

#elif defined(__SDCC_PIC18F6628)
  #include <pic18f6628.h>

#elif defined(__SDCC_PIC18F6680)
  #include <pic18f6680.h>

#elif defined(__SDCC_PIC18F6720)
  #include <pic18f6720.h>

#elif defined(__SDCC_PIC18F6722)
  #include <pic18f6722.h>

#elif defined(__SDCC_PIC18F6723)
  #include <pic18f6723.h>

#elif defined(__SDCC_PIC18F8310)
  #include <pic18f8310.h>

#elif defined(__SDCC_PIC18F8390)
  #include <pic18f8390.h>

#elif defined(__SDCC_PIC18F8393)
  #include <pic18f8393.h>

#elif defined(__SDCC_PIC18F8410)
  #include <pic18f8410.h>

#elif defined(__SDCC_PIC18F8490)
  #include <pic18f8490.h>

#elif defined(__SDCC_PIC18F8493)
  #include <pic18f8493.h>

#elif defined(__SDCC_PIC18F8520)
  #include <pic18f8520.h>

#elif defined(__SDCC_PIC18F8525)
  #include <pic18f8525.h>

#elif defined(__SDCC_PIC18F8527)
  #include <pic18f8527.h>

#elif defined(__SDCC_PIC18F8585)
  #include <pic18f8585.h>

#elif defined(__SDCC_PIC18F8620)
  #include <pic18f8620.h>

#elif defined(__SDCC_PIC18F8621)
  #include <pic18f8621.h>

#elif defined(__SDCC_PIC18F8622)
  #include <pic18f8622.h>

#elif defined(__SDCC_PIC18F8627)
  #include <pic18f8627.h>

#elif defined(__SDCC_PIC18F8628)
  #include <pic18f8628.h>

#elif defined(__SDCC_PIC18F8680)
  #include <pic18f8680.h>

#elif defined(__SDCC_PIC18F8720)
  #include <pic18f8720.h>

#elif defined(__SDCC_PIC18F8722)
  #include <pic18f8722.h>

#elif defined(__SDCC_PIC18F8723)
  #include <pic18f8723.h>

#elif defined(__SDCC_PIC18LF13K22)
  #include <pic18lf13k22.h>

#elif defined(__SDCC_PIC18LF13K50)
  #include <pic18lf13k50.h>

#elif defined(__SDCC_PIC18LF14K22)
  #include <pic18lf14k22.h>

#elif defined(__SDCC_PIC18LF14K50)
  #include <pic18lf14k50.h>

#elif defined(__SDCC_PIC18LF23K22)
  #include <pic18lf23k22.h>

#elif defined(__SDCC_PIC18LF24J10)
  #include <pic18lf24j10.h>

#elif defined(__SDCC_PIC18LF24J11)
  #include <pic18lf24j11.h>

#elif defined(__SDCC_PIC18LF24J50)
  #include <pic18lf24j50.h>

#elif defined(__SDCC_PIC18LF24K22)
  #include <pic18lf24k22.h>

#elif defined(__SDCC_PIC18LF24K50)
  #include <pic18lf24k50.h>

#elif defined(__SDCC_PIC18LF25J10)
  #include <pic18lf25j10.h>

#elif defined(__SDCC_PIC18LF25J11)
  #include <pic18lf25j11.h>

#elif defined(__SDCC_PIC18LF25J50)
  #include <pic18lf25j50.h>

#elif defined(__SDCC_PIC18LF25K22)
  #include <pic18lf25k22.h>

#elif defined(__SDCC_PIC18LF25K50)
  #include <pic18lf25k50.h>

#elif defined(__SDCC_PIC18LF25K80)
  #include <pic18lf25k80.h>

#elif defined(__SDCC_PIC18LF26J11)
  #include <pic18lf26j11.h>

#elif defined(__SDCC_PIC18LF26J13)
  #include <pic18lf26j13.h>

#elif defined(__SDCC_PIC18LF26J50)
  #include <pic18lf26j50.h>

#elif defined(__SDCC_PIC18LF26J53)
  #include <pic18lf26j53.h>

#elif defined(__SDCC_PIC18LF26K22)
  #include <pic18lf26k22.h>

#elif defined(__SDCC_PIC18LF26K80)
  #include <pic18lf26k80.h>

#elif defined(__SDCC_PIC18LF27J13)
  #include <pic18lf27j13.h>

#elif defined(__SDCC_PIC18LF27J53)
  #include <pic18lf27j53.h>

#elif defined(__SDCC_PIC18LF43K22)
  #include <pic18lf43k22.h>

#elif defined(__SDCC_PIC18LF44J10)
  #include <pic18lf44j10.h>

#elif defined(__SDCC_PIC18LF44J11)
  #include <pic18lf44j11.h>

#elif defined(__SDCC_PIC18LF44J50)
  #include <pic18lf44j50.h>

#elif defined(__SDCC_PIC18LF44K22)
  #include <pic18lf44k22.h>

#elif defined(__SDCC_PIC18LF45J10)
  #include <pic18lf45j10.h>

#elif defined(__SDCC_PIC18LF45J11)
  #include <pic18lf45j11.h>

#elif defined(__SDCC_PIC18LF45J50)
  #include <pic18lf45j50.h>

#elif defined(__SDCC_PIC18LF45K22)
  #include <pic18lf45k22.h>

#elif defined(__SDCC_PIC18LF45K50)
  #include <pic18lf45k50.h>

#elif defined(__SDCC_PIC18LF45K80)
  #include <pic18lf45k80.h>

#elif defined(__SDCC_PIC18LF46J11)
  #include <pic18lf46j11.h>

#elif defined(__SDCC_PIC18LF46J13)
  #include <pic18lf46j13.h>

#elif defined(__SDCC_PIC18LF46J50)
  #include <pic18lf46j50.h>

#elif defined(__SDCC_PIC18LF46J53)
  #include <pic18lf46j53.h>

#elif defined(__SDCC_PIC18LF46K22)
  #include <pic18lf46k22.h>

#elif defined(__SDCC_PIC18LF46K80)
  #include <pic18lf46k80.h>

#elif defined(__SDCC_PIC18LF47J13)
  #include <pic18lf47j13.h>

#elif defined(__SDCC_PIC18LF47J53)
  #include <pic18lf47j53.h>

#elif defined(__SDCC_PIC18LF65K80)
  #include <pic18lf65k80.h>

#elif defined(__SDCC_PIC18LF66K80)
  #include <pic18lf66k80.h>

#elif defined(__SDCC_PIC18LF242)
  #include <pic18lf242.h>

#elif defined(__SDCC_PIC18LF248)
  #include <pic18lf248.h>

#elif defined(__SDCC_PIC18LF252)
  #include <pic18lf252.h>

#elif defined(__SDCC_PIC18LF258)
  #include <pic18lf258.h>

#elif defined(__SDCC_PIC18LF442)
  #include <pic18lf442.h>

#elif defined(__SDCC_PIC18LF448)
  #include <pic18lf448.h>

#elif defined(__SDCC_PIC18LF452)
  #include <pic18lf452.h>

#elif defined(__SDCC_PIC18LF458)
  #include <pic18lf458.h>

#elif defined(__SDCC_PIC18LF1220)
  #include <pic18lf1220.h>

#elif defined(__SDCC_PIC18LF1230)
  #include <pic18lf1230.h>

#elif defined(__SDCC_PIC18LF1320)
  #include <pic18lf1320.h>

#elif defined(__SDCC_PIC18LF1330)
  #include <pic18lf1330.h>

#elif defined(__SDCC_PIC18LF2220)
  #include <pic18lf2220.h>

