OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/pic16/pic18fregs.h
#elif defined(__SDCC_PIC18LF2221)
  #include <pic18lf2221.h>

#elif defined(__SDCC_PIC18LF2320)
  #include <pic18lf2320.h>

#elif defined(__SDCC_PIC18LF2321)
  #include <pic18lf2321.h>

#elif defined(__SDCC_PIC18LF2331)
  #include <pic18lf2331.h>

#elif defined(__SDCC_PIC18LF2410)
  #include <pic18lf2410.h>

#elif defined(__SDCC_PIC18LF2420)
  #include <pic18lf2420.h>

#elif defined(__SDCC_PIC18LF2423)
  #include <pic18lf2423.h>

#elif defined(__SDCC_PIC18LF2431)
  #include <pic18lf2431.h>

#elif defined(__SDCC_PIC18LF2439)
  #include <pic18lf2439.h>

#elif defined(__SDCC_PIC18LF2450)
  #include <pic18lf2450.h>

#elif defined(__SDCC_PIC18LF2455)
  #include <pic18lf2455.h>

#elif defined(__SDCC_PIC18LF2458)
  #include <pic18lf2458.h>

#elif defined(__SDCC_PIC18LF2480)
  #include <pic18lf2480.h>

#elif defined(__SDCC_PIC18LF2510)
  #include <pic18lf2510.h>

#elif defined(__SDCC_PIC18LF2515)
  #include <pic18lf2515.h>

#elif defined(__SDCC_PIC18LF2520)
  #include <pic18lf2520.h>

#elif defined(__SDCC_PIC18LF2523)
  #include <pic18lf2523.h>

#elif defined(__SDCC_PIC18LF2525)
  #include <pic18lf2525.h>

#elif defined(__SDCC_PIC18LF2539)
  #include <pic18lf2539.h>

#elif defined(__SDCC_PIC18LF2550)
  #include <pic18lf2550.h>

#elif defined(__SDCC_PIC18LF2553)
  #include <pic18lf2553.h>

#elif defined(__SDCC_PIC18LF2580)
  #include <pic18lf2580.h>

#elif defined(__SDCC_PIC18LF2585)
  #include <pic18lf2585.h>

#elif defined(__SDCC_PIC18LF2610)
  #include <pic18lf2610.h>

#elif defined(__SDCC_PIC18LF2620)
  #include <pic18lf2620.h>

#elif defined(__SDCC_PIC18LF2680)
  #include <pic18lf2680.h>

#elif defined(__SDCC_PIC18LF2682)
  #include <pic18lf2682.h>

#elif defined(__SDCC_PIC18LF2685)
  #include <pic18lf2685.h>

#elif defined(__SDCC_PIC18LF4220)
  #include <pic18lf4220.h>

#elif defined(__SDCC_PIC18LF4221)
  #include <pic18lf4221.h>

#elif defined(__SDCC_PIC18LF4320)
  #include <pic18lf4320.h>

#elif defined(__SDCC_PIC18LF4321)
  #include <pic18lf4321.h>

#elif defined(__SDCC_PIC18LF4331)
  #include <pic18lf4331.h>

#elif defined(__SDCC_PIC18LF4410)
  #include <pic18lf4410.h>

#elif defined(__SDCC_PIC18LF4420)
  #include <pic18lf4420.h>

#elif defined(__SDCC_PIC18LF4423)
  #include <pic18lf4423.h>

#elif defined(__SDCC_PIC18LF4431)
  #include <pic18lf4431.h>

#elif defined(__SDCC_PIC18LF4439)
  #include <pic18lf4439.h>

#elif defined(__SDCC_PIC18LF4450)
  #include <pic18lf4450.h>

#elif defined(__SDCC_PIC18LF4455)
  #include <pic18lf4455.h>

#elif defined(__SDCC_PIC18LF4458)
  #include <pic18lf4458.h>

#elif defined(__SDCC_PIC18LF4480)
  #include <pic18lf4480.h>

#elif defined(__SDCC_PIC18LF4510)
  #include <pic18lf4510.h>

#elif defined(__SDCC_PIC18LF4515)
  #include <pic18lf4515.h>

#elif defined(__SDCC_PIC18LF4520)
  #include <pic18lf4520.h>

#elif defined(__SDCC_PIC18LF4523)
  #include <pic18lf4523.h>

#elif defined(__SDCC_PIC18LF4525)
  #include <pic18lf4525.h>

#elif defined(__SDCC_PIC18LF4539)
  #include <pic18lf4539.h>

#elif defined(__SDCC_PIC18LF4550)
  #include <pic18lf4550.h>

#elif defined(__SDCC_PIC18LF4553)
  #include <pic18lf4553.h>

#elif defined(__SDCC_PIC18LF4580)
  #include <pic18lf4580.h>

#elif defined(__SDCC_PIC18LF4585)
  #include <pic18lf4585.h>

#elif defined(__SDCC_PIC18LF4610)
  #include <pic18lf4610.h>

#elif defined(__SDCC_PIC18LF4620)
  #include <pic18lf4620.h>

#elif defined(__SDCC_PIC18LF4680)
  #include <pic18lf4680.h>

#elif defined(__SDCC_PIC18LF4682)
  #include <pic18lf4682.h>

#elif defined(__SDCC_PIC18LF4685)
  #include <pic18lf4685.h>

#elif defined(__SDCC_PIC18LF6310)
  #include <pic18lf6310.h>

#elif defined(__SDCC_PIC18LF6390)
  #include <pic18lf6390.h>

#elif defined(__SDCC_PIC18LF6393)
  #include <pic18lf6393.h>

#elif defined(__SDCC_PIC18LF6410)
  #include <pic18lf6410.h>

#elif defined(__SDCC_PIC18LF6490)
  #include <pic18lf6490.h>

#elif defined(__SDCC_PIC18LF6493)
  #include <pic18lf6493.h>

#elif defined(__SDCC_PIC18LF6520)
  #include <pic18lf6520.h>

#elif defined(__SDCC_PIC18LF6525)
  #include <pic18lf6525.h>

#elif defined(__SDCC_PIC18LF6527)
  #include <pic18lf6527.h>

#elif defined(__SDCC_PIC18LF6585)
  #include <pic18lf6585.h>

#elif defined(__SDCC_PIC18LF6620)
  #include <pic18lf6620.h>

#elif defined(__SDCC_PIC18LF6621)
  #include <pic18lf6621.h>

#elif defined(__SDCC_PIC18LF6622)
  #include <pic18lf6622.h>

#elif defined(__SDCC_PIC18LF6627)
  #include <pic18lf6627.h>

#elif defined(__SDCC_PIC18LF6628)
  #include <pic18lf6628.h>

#elif defined(__SDCC_PIC18LF6680)
  #include <pic18lf6680.h>

#elif defined(__SDCC_PIC18LF6720)
  #include <pic18lf6720.h>

#elif defined(__SDCC_PIC18LF6722)
  #include <pic18lf6722.h>

#elif defined(__SDCC_PIC18LF6723)
  #include <pic18lf6723.h>

#elif defined(__SDCC_PIC18LF8310)
  #include <pic18lf8310.h>

#elif defined(__SDCC_PIC18LF8390)
  #include <pic18lf8390.h>

#elif defined(__SDCC_PIC18LF8393)
  #include <pic18lf8393.h>

#elif defined(__SDCC_PIC18LF8410)
  #include <pic18lf8410.h>

#elif defined(__SDCC_PIC18LF8490)
  #include <pic18lf8490.h>

#elif defined(__SDCC_PIC18LF8493)
  #include <pic18lf8493.h>

#elif defined(__SDCC_PIC18LF8520)
  #include <pic18lf8520.h>

#elif defined(__SDCC_PIC18LF8525)
  #include <pic18lf8525.h>

#elif defined(__SDCC_PIC18LF8527)
  #include <pic18lf8527.h>

#elif defined(__SDCC_PIC18LF8585)
  #include <pic18lf8585.h>

#elif defined(__SDCC_PIC18LF8620)
  #include <pic18lf8620.h>

#elif defined(__SDCC_PIC18LF8621)
  #include <pic18lf8621.h>

#elif defined(__SDCC_PIC18LF8622)
  #include <pic18lf8622.h>

#elif defined(__SDCC_PIC18LF8627)
  #include <pic18lf8627.h>

#elif defined(__SDCC_PIC18LF8628)
  #include <pic18lf8628.h>

#elif defined(__SDCC_PIC18LF8680)
  #include <pic18lf8680.h>

#elif defined(__SDCC_PIC18LF8720)
  #include <pic18lf8720.h>

#elif defined(__SDCC_PIC18LF8722)
  #include <pic18lf8722.h>

#elif defined(__SDCC_PIC18LF8723)
  #include <pic18lf8723.h>

#else
  #error The sdcc is not supported by this processor!
#endif

#ifndef __CONCAT2
  #define __CONCAT2(a, b)       a##b
#endif

#ifndef __CONCAT
  #define __CONCAT(a, b)        __CONCAT2(a, b)
#endif

#define __CONFIG(address, value) \
    static const __code unsigned char __at(address) __CONCAT(_conf, __LINE__) = (value)

#define Nop()                   __asm nop __endasm
#define ClrWdt()                __asm clrwdt __endasm
#define Sleep()                 __asm sleep __endasm
#define Reset()                 __asm reset __endasm

    // To pointer manipulations. (From the sdcc/src/pic16/gen.h file.)
#define GPTR_TAG_MASK           0xC0    // Generated by the device-manager.pl program.
#define GPTR_TAG_DATA           0x80
#define GPTR_TAG_EEPROM         0x40
#define GPTR_TAG_CODE           0x00

#endif // #ifndef __PIC18FREGS_H__
